app/views/blogs/show.html.haml

      %h3 Followed users
      =link_to @blog.user.followed_users.count, following_path(@blog.user)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT COUNT(*) FROM "users" INNER JOIN "relationships" ON "users"."id" = "relationships"."follower_id" WHERE "relationships"."followed_id" = 1

      %h3 Followers
      =link_to @blog.user.followers.count, followers_path(@blog.user)
---
SELECT COUNT(*) FROM "users" INNER JOIN "relationships" ON "users"."id" = "relationships"."followed_id" WHERE "relationships"."follower_id" = 1

      %h2 Posts
      - @blog.posts.each do |post|
        .post
---
SELECT "posts".* FROM "posts" WHERE "posts"."blog_id" = 1 ORDER BY posts.created_at DESC