app/controllers/blogs_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def show
    @new_post = Post.new
    @user = @blog.user
    @users = User.select { |u| u.id != @user.id }
    @invited = @blog.invitations.collect { |i| i.user }

INSERT INTO "blogs" ("blog_title", "created_at", "description", "updated_at", "user_id") VALUES ('Simple blog', '2012-03-29 21:10:02.444000', 'aaaa', '2012-03-29 21:10:02.444000', 1)
---
  def create
    @blog = current_user.blogs.build(params[:blog])

    respond_to do |format|
      if @blog.save

UPDATE "blogs" SET "blog_title" = 'Simple blog edited', "updated_at" = '2012-04-03 20:48:38.548000' WHERE "blogs"."id" = 1
---
  def update
    respond_to do |format|
      if @blog.update_attributes(params[:blog])

DELETE FROM "blogs" WHERE "blogs"."id" = 2
---
  def destroy
    @blog.destroy