app/controllers/home_controller.rb

  def index
  	@blogs = current_user.blogs.find_all{ |blog| blog.kind == "Blog" }
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."user_id" = 1