app/controllers/posts_controller.rb

INSERT INTO "posts" ("blog_id", "content", "created_at", "updated_at", "user_id") VALUES (1, 'safdasfs', '2012-03-30 18:30:53.536000', '2012-03-30 18:30:53.536000', 1)
---
  def create
    @post = @blog.posts.build(params[:post])
    @post.user = current_user
    respond_to do |format|
      @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."blog_id" = 1 AND "posts"."id" = 20 ORDER BY posts.created_at DESC LIMIT 1
DELETE FROM "posts" WHERE "posts"."id" = 15
---
  def destroy
    @post = @blog.posts.find(params[:id])
    @post.destroy