app/controllers/sessions_controller.rb

UPDATE "users" SET "fullname" = 'qwrqwr', "description" = 'ewrwerwerwerwe', "updated_at" = '2012-04-09 22:30:34.673000' WHERE "users"."id" = 1
---
  def update_profile
    respond_to do |format|
      if @user.update_attributes(params[:user])