app/views/devise/show_profile.html.haml

SELECT "blogs".* FROM "blogs" WHERE "blogs"."user_id" = 1
---
%table{ :style => "width: 300px;"}
  - @user.blogs.each do |blog|